## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/20621112225).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.idp_login_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "idp_login_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_appautoscaling_policy.user_portal_cpu[0] will be created
  + resource "aws_appautoscaling_policy" "user_portal_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "user_portal_cpu"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/idp/user_portal"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 25

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.user_portal_memory[0] will be created
  + resource "aws_appautoscaling_policy" "user_portal_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "user_portal_memory"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/idp/user_portal"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 25

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.user_portal[0] will be created
  + resource "aws_appautoscaling_target" "user_portal" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + region             = "ca-central-1"
      + resource_id        = "service/idp/user_portal"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + suspended_state (known after apply)
    }

  # aws_cloudwatch_log_group.user_portal will be created
  + resource "aws_cloudwatch_log_group" "user_portal" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "user_portal"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_ecs_cluster.idp will be created
  + resource "aws_ecs_cluster" "idp" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "idp"
      + region   = "ca-central-1"
      + tags_all = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.user_portal[0] will be created
  + resource "aws_ecs_service" "user_portal" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "user_portal"
      + platform_version                   = "1.4.0"
      + propagate_tags                     = "SERVICE"
      + region                             = "ca-central-1"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "user_portal"
          + container_port   = 3000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-033d388debda7252d",
            ]
          + subnets          = [
              + "subnet-07e38df0760d389d1",
              + "subnet-07f9debd31e48ce64",
              + "subnet-0af8e6e3cf80f582d",
            ]
        }
    }

  # aws_ecs_task_definition.user_portal will be created
  + resource "aws_ecs_task_definition" "user_portal" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "user_portal"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + region                   = "ca-central-1"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.ecs_xray will be created
  + resource "aws_iam_policy" "ecs_xray" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for allowing X-Ray tracing"
      + id               = (known after apply)
      + name             = "ecs_xray"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.user_portal_ssm will be created
  + resource "aws_iam_policy" "user_portal_ssm" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "formsS3Access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.codedeploy will be created
  + resource "aws_iam_role" "codedeploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.idp_user_portal will be created
  + resource "aws_iam_role" "idp_user_portal" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "idp_user_portal"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.codedeploy will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "codedeploy"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_forms will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_forms" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "idp_user_portal"
    }

  # aws_iam_role_policy_attachment.ecs_xray will be created
  + resource "aws_iam_role_policy_attachment" "ecs_xray" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "idp_user_portal"
    }

  # aws_iam_role_policy_attachment.ssm_user_portal will be created
  + resource "aws_iam_role_policy_attachment" "ssm_user_portal" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "idp_user_portal"
    }

  # aws_lb_target_group.user_portal[0] will be created
  + resource "aws_lb_target_group" "user_portal" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "user-portal-0"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "ca-central-1"
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ad5b3739860129d0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/ui/v2"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_lb_target_group.user_portal[1] will be created
  + resource "aws_lb_target_group" "user_portal" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "user-portal-1"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "ca-central-1"
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ad5b3739860129d0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/ui/v2"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.idp has moved to aws_route53_record.idp[0]
    resource "aws_route53_record" "idp" {
        id                               = "Z05990652HOQ0SGHD81ZC_auth.forms-staging.cdssandbox.xyz_A"
        name                             = "auth.forms-staging.cdssandbox.xyz"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ssm_parameter.idp_login_service_user_token will be created
  + resource "aws_ssm_parameter" "idp_login_service_user_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "idp_login_service_user_token"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_wafv2_web_acl.idp will be updated in-place
  ~ resource "aws_wafv2_web_acl" "idp" {
        id                          = "bab5476e-86d5-4718-aa69-55b379a8673d"
        name                        = "idp"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      - rule {
          - name     = "InvalidHost" -> null
          - priority = 5 -> null

          - action {
              - block {
                }
            }

          - statement {
              - not_statement {
                  - statement {
                      - byte_match_statement {
                          - positional_constraint = "EXACTLY" -> null
                          - search_string         = "auth.forms-staging.cdssandbox.xyz" -> null

                          - field_to_match {
                              - single_header {
                                  - name = "host" -> null
                                }
                            }

                          - text_transformation {
                              - priority = 1 -> null
                              - type     = "COMPRESS_WHITE_SPACE" -> null
                            }
                          - text_transformation {
                              - priority = 2 -> null
                              - type     = "LOWERCASE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "InvalidHost" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "InvalidHost"
          + priority = 5

          + action {
              + block {
                }
            }

          + statement {
              + not_statement {
                  + statement {
                      + or_statement {
                          + statement {
                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "auth.forms-staging.cdssandbox.xyz"

                                  + field_to_match {
                                      + single_header {
                                          + name = "host"
                                        }
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 1
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "InvalidHost"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_cluster.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_ecs_cluster" "this" {
      - arn      = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> null
      - id       = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> null
      - name     = "idp" -> null
      - region   = "ca-central-1" -> null
      - tags     = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # module.idp_ecs.aws_ecs_cluster_capacity_providers.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_ecs_cluster_capacity_providers" "this" {
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - cluster_name       = "idp" -> null
      - id                 = "idp" -> null
      - region             = "ca-central-1" -> null

      - default_capacity_provider_strategy {
          - base              = 1 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }
    }

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/idp/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "zitadel:39" -> "arn:aws:ecs:ca-central-1:687401027353:task-definition/zitadel:34"
        # (17 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this will be updated in-place
  ~ resource "aws_ecs_task_definition" "this" {
        id                       = "zitadel"
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ track_latest             = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 18 to add, 3 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 2 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold =...
```

</details>

